import { Ionicons } from '@expo/vector-icons';
import { FlashList } from '@shopify/flash-list';
import { Text, Card, useTheme } from '@ui-kitten/components';
import { FlatList, Pressable, Share, StyleSheet, View } from 'react-native';
export const doaa = [
    {
        "arab": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً ۚ إِنَّكَ أَنْتَ الْوَهَّابُ",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَآ إِنَّنَآ ءَامَنَّا فَٱغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ ٱلنَّارِ",
        "source": "quran"
    },
    {
        "arab": "رَّبَّنَآ إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِى لِلْإِيمَٰنِ أَنْ ءَامِنُوا۟ بِرَبِّكُمْ فَـَٔامَنَّا ۚ رَبَّنَا فَٱغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّـَٔاتِنَا وَتَوَفَّنَا مَعَ ٱلْأَبْرَارِ • رَبَّنَا وَءَاتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ ٱلْقِيَٰمَةِ ۗ إِنَّكَ لَا تُخْلِفُ ٱلْمِيعَادَ",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظّٰلِمِيْنَ",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا ٱفْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِٱلْحَقِّ وَأَنتَ خَيْرُ ٱلْفَٰتِحِينَ",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ ٱلظَّٰلِمِينَ • وَنَجِّنَا بِرَحْمَتِكَ مِنَ ٱلْقَوْمِ ٱلْكَٰفِرِينَ",
        "source": "quran"
    },
    {
        "arab": "رَبِّ إِنِّىٓ أَعُوذُ بِكَ أَنْ أَسْـَٔلَكَ مَا لَيْسَ لِى بِهِۦ عِلْمٌ ۖ وَإِلَّا تَغْفِرْ لِى وَتَرْحَمْنِىٓ أَكُن مِّنَ ٱلْخَٰسِرِينَ",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
        "source": "quran"
    },
    {
        "arab": "رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَآ اٰتِنَا مِنْ لَّدُنْكَ رَحْمَةً وَّهَيِّئْ لَنَا مِنْ اَمْرِنَا رَشَدًا",
        "source": "quran"
    },
    {
        "arab": "رَبِّ اشْرَحْ لِيْ صَدْرِيْ ۙ • وَيَسِّرْ لِيْٓ اَمْرِيْ ۙ • وَاحْلُلْ عُقْدَةً مِّنْ لِّسَانِيْ ۙ • يَفْقَهُوْا قَوْلِيْ",
        "source": "quran"
    },
    {
        "arab": "رَبِّ لَا تَذَرْنِيْ فَرْدًا وَ أَنْتَ خَيْرُ الْوَارِثِيْنَ • رَبِّ هَبْ لِيْ مِنْ لَّدُنْكَ ذُرِّيَّةً طَيِّبَةًۚ اِنَّكَ سَمِيْعُ الدُّعَاۤءِ",
        "source": "quran"
    },
    {
        "arab": "رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ • وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ ۖ اِنَّ عَذَابَهَا كَانَ غَرَامًا",
        "source": "quran"
    },
    {
        "arab": "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَّحْمَةً وَّعِلْمًا فَاغْفِرْ لِلَّذِيْنَ تَابُوْا وَاتَّبَعُوْا سَبِيْلَكَ وَقِهِمْ عَذَابَ الْجَحِيْمِ • رَبَّنَا وَاَدْخِلْهُمْ جَنّٰتِ عَدْنِ ِۨالَّتِيْ وَعَدْتَّهُمْ وَمَنْ صَلَحَ مِنْ اٰبَاۤىِٕهِمْ وَاَزْوَاجِهِمْ وَذُرِّيّٰتِهِمْ ۗاِنَّكَ اَنْتَ الْعَزِيْزُ الْحَكِيْمُۙ",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا ٱغْفِرْ لَنَا وَلِإِخْوَٰنِنَا ٱلَّذِينَ سَبَقُونَا بِٱلْإِيمَٰنِ وَلَا تَجْعَلْ فِى قُلُوبِنَا غِلًّا لِّلَّذِينَ ءَامَنُوا۟ رَبَّنَآ إِنَّكَ رَءُوفٌ رَّحِيمٌ",
        "source": "quran"
    },
    {
        "arab": "رَّبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ ٱلْمَصِيرُ رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا۟ وَٱغْفِرْ لَنَا رَبَّنَآ ۖ إِنَّكَ أَنتَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا مَا خَلَقْتَ هَٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَآ اَخْرِجْنَا مِنْ هٰذِهِ الْقَرْيَةِ الظَّالِمِ اَهْلُهَاۚ وَاجْعَلْ لَّنَا مِنْ لَّدُنْكَ وَلِيًّاۚ وَاجْعَلْ لَّنَا مِنْ لَّدُنْكَ نَصِيْرًا",
        "source": "quran"
    },
    {
        "arab": "اللّٰهُمَّ رَبَّنَآ اَنْزِلْ عَلَيْنَا مَاۤىِٕدَةً مِّنَ السَّمَاۤءِ تَكُوْنُ لَنَا عِيْدًا لِّاَوَّلِنَا وَاٰخِرِنَا وَاٰيَةً مِّنْكَ وَارْزُقْنَا وَاَنْتَ خَيْرُ الرّٰزِقِيْنَ",
        "source": "quran"
    },
    {
        "arab": "رَبِّ أَنْزِلْنِي مُنْزَلًا مُبَارَكًا وَأَنْتَ خَيْرُ الْمُنْزِلِينَ",
        "source": "quran"
    },
    {
        "arab": "رَبِّ هَبْ لِى حُكْمًا وَأَلْحِقْنِى بِٱلصَّٰلِحِينَ وَٱجْعَل لِّى لِسَانَ صِدْقٍ فِى ٱلْءَاخِرِينَ وَٱجْعَلْنِى مِن وَرَثَةِ جَنَّةِ ٱلنَّعِيمِ",
        "source": "quran"
    },
    {
        "arab": "رَبِّ ٱبْنِ لِى عِندَكَ بَيْتًا فِى ٱلْجَنَّةِ وَنَجِّنِى مِن فِرْعَوْنَ وَعَمَلِهِۦ وَنَجِّنِى مِنَ ٱلْقَوْمِ ٱلظَّٰلِمِينَ",
        "source": "quran"
    },
    {
        "arab": "رَّبِّ ٱغْفِرْ لِى وَلِوَٰلِدَىَّ وَلِمَن دَخَلَ بَيْتِىَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَٱلْمُؤْمِنَٰتِ وَلَا تَزِدِ ٱلظَّٰلِمِينَ إِلَّا تَبَارًۢا",
        "source": "quran"
    },
    {
        "arab": "لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَآ أَتْمِمْ لَنَا نُورَنَا وَٱغْفِرْ لَنَآ ۖ إِنَّكَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
        "source": "quran"
    },
    {
        "arab": "اَللَّهُمَّ اِغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي",
        "source": "hadits"
    },
    {
        "arab": "اللَّهُمَّ أصْلِحْ لِي دِيْنِيَ الَّذِي هُوَ عِصْمَةُ أَمْرِي ، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي ، وَأَصْلِحْ لِي آخِرتِي الَّتي فِيهَا مَعَادِي ، وَاجْعَلِ الحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ ، وَاجْعَلِ المَوتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ",
        "source": "hadits"
    },
    {
        "arab": "اَللَّهُمَّ اِنِّى اَسْأَلُكَ رَحمَةً مِنْ عِنْدِكَ تُهْدِى بِهَا قلْبِى، وَتَجْمَعُ بِها شَمْلِى. وَتَرُدَّ بِهَا الْفِتْنَ عَنِّى وَتُصْلِحُ بِهَا دِيْنِى وَتَحْفَظُ بِها غَائِبِى وَتَرْفَعُ بِهَا شَاهِدِى وَتُزَكِّى بِهَا عَمَلِى.ضُ بِهَا وَجْهِى وَتُلْهِمُنِى بِهَا رُشْدِى وَتُبَيِّ وَتُعْصِمُنِى بِهَا مِنْ كُلِّ سُوْءٍ",
        "source": "hadits"
    },
    {
        "arab": "اللَّهُمَّ إِنِّي ظَلَمتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أنْتَ، فَاغْفِرْ لي مَغْفِرَةً مِنْ عِنْدِكَ، وارْحَمْنِي، إنَّكَ أنْتَ الغَفُورُ الرَّحِيمُ",
        "source": "hadits"
    },
    {
        "arab": "اَللَّهُمَّ أَنْتَ رَبِّيْ لاَ إِلَـهَ إِلاَّ أَنْتَ، خَلَقْتَنِيْ وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوْءُ بِذَنْبِيْ فَاغْفِرْ لِيْ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ",
        "source": "hadits"
    },
    {
        "arab": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ",
        "source": "hadits"
    },
    {
        "arab": "اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي",
        "source": "hadits"
    },
    {
        "arab": "اَللَّهُمَّ اِنَّا نَسْأَلُكَ مِنْ كُلِّ خَيْرٍ مَا سَأَلَكَ مِنْه نَبِيُّكَ مُحَمَّدٌ، وَنعَوْذُبِكَ مِنْ كُلِّ شَرٍّ مَااسْتَعَاذَكَ مِنْه نَبِيُّكَ مُحَمَّدٌ .وَاَنْتَ الْمُسْتَعَانُ وَعَلَيْكَ الْبَلاَغ وَلاَحَوْلَ ولَا قَوَّة اِلا بِاللهِ",
        "source": "hadits"
    },
    {
        "arab": "اَللَّهُمَّ اِنِّى اَسْأَلُكَ الثَّبَاتَ فِى الاَمْرِ وَاَسْأَلُكَ الْعَزِيْمَة فِى الرُّشْدِ. وَاَسْأَلُكَ شُكْرَ نِعْمَتِكَ وَحُسْنَ عِبَادَتِكَ وَاَسْأَلُكَ لِسَانًا صَادِقًا وَقَلْبًا سَلِيْمًا وَاَعُوْذُبِكَ مِنْ شَرِّ مَا تَعْلَمُ وَاَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ، وَاَسْتَغْفِرُكَ مِمَّا تَعْلَمُ اِنَّكَ اَنْتَ عَلاَّمُ الْغُيُوْبِ",
        "source": "hadits"
    },
    {
        "arab": "اَللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍعَدَدَ اَنْوَاعِ الرِّزْقِ وَالْفُتُوْحَاتِ، بَابَاسِطَ الَّذِيْ يبَْسُطُ الرِّزْقَ لِمَنْ يَشَآء بِغَيْرِحِسَابٍ اُبْسُطْ عَلَي رِزْقًا كَثِيْرًا مِنْ كُلِّ جِهَةٍ مِنْ خَزَائِنِ رِزْقِكَ بِغَيْرمِنَّةٍ مَخْلُوْقٍ بِفَضْلِكَ وَكَرَمِكَ وَعَلَى اَلِهِ وَصَحْبِهِ وَسَلَّمَ",
        "source": "pilihan"
    },
    {
        "arab": "اَللَّهُمَّ يَاغَنِيُّ يَاحمِيْدُ يَامُبْدِئُ يَامُعِيْدُ يَارَحِيْمُ يَاوَدُوْدُ اَغْنِنِى بِحَلاَلِكَ عَنْ حَرَامِكَ وَاكْفِنِى بِفَضْلِكَ عَمَّنْ سِوَاكَ وَصَلَّى اللهُ عَلَى مُحَمَّدٍ وَاَلِهِ وَصَحْبِهِ وَسَلَّمَ",
        "source": "pilihan"
    },
    {
        "arab": "بِسْمِ اللهِ عَلَى نَفْسِي وَمَالِي وَدِيْنِي. اَللهُمَّ رَضِّنِى بِقَضَائِكَ وَبَارِكْ لِيْ فِيْمَا قُدِّرَ عَلَيْهِ حَتَّى لاَاُحِبُّ تَعْجِيْلَ مَااَخَّرْتَ وَلاَتَأْخِيْرَ مَاعَجَّلْتَ",
        "source": "pilihan"
    },
    {
        "arab": "اللَّهُمَّ رَبَّ النَّاسِ مُذْهِبَ الْبَاسِ اشْفِ أَنْتَ الشَّافِى لاَ شَافِىَ إِلاَّ أَنْتَ ، شِفَاءً لاَ يُغَادِرُ سَقَمًا",
        "source": "pilihan"
    },
    {
        "arab": "اللَّهُمَّ إنِّي أسْألُكَ مُوجِبَاتِ رَحْمَتِكَ، وَعَزَائِمَ مَغْفِرَتِكَ، والسَّلامَةَ مِنْ كُلِّ إثْمٍ، والغَنِيمَةَ مِنْ كُلِّ بِرٍّ ، والفَوْزَ بالجَنَّةِ ، والنَّجَاةَ مِنَ النَّارِ",
        "source": "pilihan"
    },
    {
        "arab": "اَلْحَمْدُ ِللهِ الَّذِى أَحْيَانَا بَعْدَمَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
        "source": "harian"
    },
    {
        "arab": "اَلْحَمْدُ ِللهِ الَّذِيْ قَطْلَ الْحَاجَتِ",
        "source": "harian"
    },
    {
        "arab": "أَللَّهُمَّ إِنِّى أَعُوْذُ بِكَ مِنْ عَمَلِ الشَّيْطَان وَسَيِّئاَتِ اْلأَحْلاَمِ",
        "source": "harian"
    },
    {
        "arab": "اللَّهُمَّ إِنِّى أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِث",
        "source": "harian"
    },
    {
        "arab": "اَللّٰهُمَّ حَسِّنْ فَرْجِىْ مِنَ الْفَوَاخِشِ وَظَهِّرْ قَلْبِيْ مِنَ النِّفَاقِ",
        "source": "harian"
    },
    {
        "arab": "الْحَمْدُ الِلّٰهِ الَّذِىْ اَذْهَبَ عَنِّى اْلاَذَى وَعَافَانِىْ",
        "source": "harian"
    },
    {
        "arab": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا هُوَ لَهُ ، وَأَعُوْذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا هُوَ لَهُ",
        "source": "harian"
    },
    {
        "arab": "اَللّٰهُمَّ كَمَا حَسَّـنْتَ خَلْقِـيْ فَحَسِّـنْ خُلُقِـيْ",
        "source": "harian"
    },
    {
        "arab": "اللَّهُمَّ بارِكْ لَنا فِيما رَزَقْتَنا وَقِنا عَذَابَ النَّارِ",
        "source": "harian"
    },
    {
        "arab": "اَلْحَمْدُ ِللهِ الَّذِيْنَ اَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مِنَ الْمُسْلِمِيْنَ",
        "source": "harian"
    },
    {
        "arab": "اَللّٰهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِعَنَّابُعْدَهُ اَللّٰهُمَّ اَنْتَ الصَّاحِبُ فِى السَّفَرِوَالْخَلِيْفَةُفِى الْاَهْلِ",
        "source": "harian"
    },
    {
        "arab": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ",
        "source": "harian"
    },
    {
        "arab": "بِسْمِ اللهِ مَجْرَهَا وَمُرْسَهَآاِنَّ رَبِّىْ لَغَفُوْرٌرَّحِيْمٌ",
        "source": "harian"
    },
    {
        "arab": "اَلْحَمْدُ ِللهِ الَّذِى سَلَمَنِى وَالَّذِى اَوَنِى وَالَّذِى جَمَعَ الشَّمْلَ بِئ",
        "source": "harian"
    },
    {
        "arab": "بِسْمِ اللهِ الَّذِيْ لاَ إِلَهَ إِلَّا هُوَ",
        "source": "harian"
    },
    {
        "arab": "بِاسْمِكَ اللهُمَّ أَحْيَا وَأَمُوْتُ",
        "source": "harian"
    },
    {
        "arab": "الحَمْدُ للهِ الَّذِي أَحْيَانَا بعْدَ مَا أماتَنَا وإِلَيْهِ النُّشُورُ",
        "source": "harian"
    },
    {
        "arab": "أَعُوْذً بِكَلِمَاتِ اللهِ تَامَّةِ مِنْ غَضَبِهِ وَمِنْ شَرِّ عِبَادِهِ وَمِنْ هَمَزَاتِ الشَّيَاطِيْنِ وَأَنْ يَحْضُرُوْنَ",
        "source": "harian"
    },
    {
        "arab": "لَاإِلٰهَ الاَّ أَنتَ سُبحَانَكَ اللّٰهُمَّ زِدْنِي عِلمًا وَلا تُزِغ قَلبِي بَعْدَ إِذْ هَدَيتَنِي وَهَب لِي مِن لَدُنكَ رَحمَةً إِنَّكَ أَنْتَ الْوَهَّابِ",
        "source": "harian"
    },
    {
        "arab": "اَللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ ضِيْقِ الدُّنْيَا وَضِيْقِ يَوْمِ اْلقِيَامَةِ",
        "source": "harian"
    },
    {
        "arab": "اَصْبَحْنَاوَاَصْبَحَ الْمُلْكُ لِلَّهِ عَزَّ وَجَلَّ وَالحَْمْدُ للهِ وَالْكِبْرِيَاء وَالْعَظَمَة لِلَّهِ وَالخَْلْقُ وَاْلاَمْرُ وَاللَّيْلُ وَالنَّهَارُ وَمَا سَكَنَ فِيْهِمَا لِلَّهِ تَعَالَى. اللَّهُمَّ اجْعَلْ اَوَّلَ هَذَا النَّهَارِ صَلاَحًا وَاَوْسَطَه نَجَاحًا وَآخِرَه فَلاَحًا يَا اَرْحَمَ الرَّاحِمِين",
        "source": "harian"
    },
    {
        "arab": "اللَّهُمَّ إنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً",
        "source": "harian"
    },
    {
        "arab": "أَمْسَيْنَا وَأَمْسَى المُلْكُ للهِ، وَالحَمْدُ للهِ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ لَهُ المُلْكُ وَلَهُ الحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَيْلَةِ وَشَرِّ مَا بَعْدَهَا، رَبِّ أَعُوذُ بِكَ مِنَ الكَسْلِ وَسُوْءِ الكِبَرِ، أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي القَبْرِ",
        "source": "harian"
    },
    {
        "arab": "اَللهُمَّ اِنّىْ اَسْأَلُكَ خَيْرَالْمَوْلِجِ وَخَيْرَالْمَخْرَجِ بِسْمِ اللهِ وَلَجْنَا وَبِسْمِ اللهِ خَرَجْنَا وَعَلَى اللهِ رَبّنَا تَوَكَّلْنَا",
        "source": "harian"
    },
    {
        "arab": "بِسْمِ اللهِ تَوَكَّلْتُ عَلَى اللهِ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
        "source": "harian"
    },
    {
        "arab": "اللَّهُمَّ اجْعَلْ فِى قَلْبِى نُورًا وَفِى لِسَانِى نُورًا وَاجْعَلْ فِى سَمْعِى نُورًا وَاجْعَلْ فِى بَصَرِى نُورًا وَاجْعَلْ مِنْ خَلْفِى نُورًا وَمِنْ أَمَامِى نُورًا وَاجْعَلْ مِنْ فَوْقِى نُورًا وَمِنْ تَحْتِى نُورًا. اللَّهُمَّ أَعْطِنِى نُورًا",
        "source": "harian"
    },
    {
        "arab": "اَللّٰهُمَّ افْتَحْ لِيْ اَبْوَابَ رَحْمَتِكَ",
        "source": "harian"
    },
    {
        "arab": "اَللّٰهُمَّ اِنِّى اَسْأَلُكَ مِنْ فَضْلِكَ",
        "source": "harian"
    },
    {
        "arab": "بِسْمِ اللهِ اَللّهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا",
        "source": "harian"
    },
    {
        "arab": "باسْمِ اللَّهِ اللَّهُمَّ إنِّي أسألُكَ خَيْرَ هَذِهِ السُّوقِ وَخَيْرَ ما فِيها وأعُوذُ بِكَ مِنْ شَرّها وَشَرّ مَا فِيهَا اللَّهُمَّ إنِّي أعُوذُ بِكَ أنْ أُصِيبَ فِيْهَا يَمِيْناً فاجِرَةً أوْ صَفْقَةً خَاسِرَةً",
        "source": "harian"
    },
    {
        "arab": "اَللَّهُمَّ اجْعَلْ نَفْسِيْ مُطْمَئِنَّةً، تُؤْمِنُ بِلِقَائِكَ، وَتَرْضَى بِقَضَائِكَ",
        "source": "harian"
    },
    {
        "arab": "اللَّهُمَّ غَارَتِ النُّجُومُ وَهَدَأَتِ الْعُيُونُ وَأَنْتَ حَيٌّ قَيُّومٌ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ يَا حَيُّ يَا قَيُّومُ أَهْدِئْ لَيْلِيْ وَأَنِمْ عَيْنِي",
        "source": "harian"
    },
    {
        "arab": "اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرًا لِي، وَتَوَفَّنِي إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِي",
        "source": "harian"
    },
    {
        "arab": "اللَّهُمَّ أَحْيِهِ مَا كَانَتِ الْحَيَاةُ خَيْرًا لَهُ، وَتَوَفَّهُ إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لَهُ",
        "source": "harian"
    },
    {
        "arab": "أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ. اللَّهُمَّ اجْعَلْنِى مِنَ التَّوَّابِينَ وَاجْعَلْنِى مِنَ الْمُتَطَهِّرِينَ وَاجْعَلنِى مِن عِبَادِكَ الصَّالِحِيْن",
        "source": "ibadah"
    },
    {
        "arab": "اللّٰهُمَّ رَبَّ هٰذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلَاةِ الْقَائِمَةِ آتِ سَيِّدَنَـامُحَمـَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ وَالدَّرَجَةَ الرَّفِيْعَةَ وَابْعَثْهُ مَقَامًا المَحْمُودًا الَّذِيْ وَعَدْتَهُ إِنَّكَ لَا تُخْلِفُ الْمِيْعَادَ",
        "source": "ibadah"
    },
    {
        "arab": "رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ",
        "source": "ibadah"
    },
    {
        "arab": "اَللّٰهُمَّ اِنَّ الضُّحَآءَ ضُحَاءُكَ وَالْبَهَاءَ بَهَاءُكَ وَالْجَمَالَ جَمَالُكَ وَالْقُوَّةَ قُوَّتُكَ وَالْقُدْرَةَ قُدْرَتُكَ وَالْعِصْمَةَ عِصْمَتُكَ اَللّٰهُمَّ اِنْ كَانَ رِزْقِى فِى السَّمَآءِ فَأَنْزِلْهُ وَاِنْ كَانَ فِى اْلاَرْضِ فَأَخْرِجْهُ وَاِنْ كَانَ مُعَسَّرًا فَيَسِّرْهُ وَاِنْ كَانَ حَرَامًا فَطَهِّرْهُ وَاِنْ كَانَ بَعِيْدًا فَقَرِّبْهُ بِحَقِّ ضُحَاءِكَ وَبَهَاءِكَ وَجَمَالِكَ وَقُوَّتِكَ وَقُدْرَتِكَ آتِنِىْ مَآاَتَيْتَ عِبَادَكَ الصَّالِحِيْنَ",
        "source": "ibadah"
    },
    {
        "arab": "اَللّٰهُمَّ إِنِّيْ أَسْتَخِيْرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيْمِ، فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ، وَتَعْلَمُ وَلَا أَعْلَمُ، وَأَنْتَ عَلَّامُ الْغُيُوْبِ. اَللّٰهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هٰذَا اْلأَمْرَ .... خَيْرٌ لِيْ فِيْ دِيْنِيْ وَمَعَاشِيْ وَعَاقِبَةِ أَمْرِيْ فَاقْدُرْهُ لِيْ وَيَسِّرْهُ لِيْ ثُمَّ بَارِكْ لِيْ فِيْهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هٰذَا اْلأَمْرَ شَرٌّ لِيْ فِيْ دِيْنِيْ وَمَعَاشِيْ وَعَاقِبَةِ أَمْرِيْ فَاصْرِفْهُ عَنِّيْ وَاصْرِفْنِيْ عَنْهُ وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ ثُمَّ أَرْضِنِيْ بِهِ",
        "source": "ibadah"
    },
    {
        "arab": "اَللهُمَّ رَبَّنَا لَكَ الْحَمْدُ اَنْتَ قَيِّمُ السَّمَوَاتِ وَاْلاَرْضِ وَمَنْ فِيْهِنَّ. وَلَكَ الْحَمْدُ اَنْتَ مَلِكُ السَّمَوَاتِ واْلاَرْضِ وَمَنْ فِيْهِنَّ. وَلَكَ الْحَمْدُ اَنْتَ نُوْرُ السَّمَوَاتِ وَاْلاَرْضِ وَمَنْ فِيْهِنَّ. وَلَكَ الْحَمْدُ اَنْتَ الْحَقُّ وَوَعْدُكَ الْحَقُّ وَلِقَاءُكَ حَقٌّ وَقَوْلُكَ حَقٌّ وَالْجَنَّةُ حَقٌّ وَالنَّارُ حَقٌّ وَالنَّبِيُّوْنَ حَقٌّ وَمُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَقٌّ وَالسَّاعَةُ حَقٌّ. اَللهُمَّ لَكَ اَسْلَمْتُ وَبِكَ اَمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَاِلَيْكَ اَنَبْتُ وَبِكَ خَاصَمْتُ وَاِلَيْكَ حَاكَمْتُ فَاغْفِرْلِيْ مَاقَدَّمْتُ وَمَا اَخَّرْتُ وَمَا اَسْرَرْتُ وَمَا اَعْلَنْتُ وَمَا اَنْتَ اَعْلَمُ بِهِ مِنِّيْ. اَنْتَ الْمُقَدِّمُ وَاَنْتَ الْمُؤَخِّرُ لاَاِلَهَ اِلاَّ اَنْتَ. وَلاَ حَوْلَ وَلاَ قُوَّةَ اِلاَّ بِاللهِ",
        "source": "ibadah"
    },
    {
        "arab": "اَللّٰهُمَّ هٰذَا حَرَمُكَ وَأَمْنُكَ فَحَرِّمْ لَحْمِيْ وَدَمِيْ وَشَعْرِيْ وَبَشَرِيْ عَلَى النَّارِ وَاٰمِنِّيْ مِنْ عَذَابِكَ يَوْمَ تَبْعَثُ عِبَادَكَ وَاجْعَلْنِيْ مِنْ أَوْلِيَآئِكَ وَأَهْلِ طَاعَتِكَ",
        "source": "haji"
    },
    {
        "arab": "اَللّٰهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ فَحَيِّنَا رَبَّنَا بِالسَّلَامِ وَأَدْخِلْنَا الْجَنَّةَ دَارَالسَّلَامَ تَبَارَكْتَ وَتَعَالَيْتَ يَا ذَاالْجَلَالِ وَاْلإِكْرَامِ. اَللّٰهُمَّ افْتَحْ لِيْ أَبْوَابَ رَحْمَتِكَ وَمَغْفِرَتِكَ وَأَدْخِلْنِيْ فِيْهَا. بِسْمِ اللهِ وَالْحَمْدُ ِللهِ وَالصَّلَاةُ وَالسَّلَامُ عَلٰى رَسُوْلِ اللهِ",
        "source": "haji"
    },
    {
        "arab": "اللَّهُمَّ زِدْ هَذَا الْبَيْتَ تَشْرِيفًا وَتَعْظِيمًا وَتَكْرِيمًا وَمَهَابَةً وَزِدْ مَنْ شَرّفَهُ وَكَرّمَهُ مِمَّنْ حَجَّهُ أَوِاعْتَمَرَهُ تَشْرِيفًا وَتَكْرِيمًا وَتَعْظِيمًا وَبِرًّا",
        "source": "haji"
    },
    {
        "arab": "اللَّهُمَّ هَذَا حَرَامُ رَسُولِكَ وَاجْعَلْهُ وِقَايَةً مِنَ النَّارِ َوأَمَنَةً مِنَ الْعَذَابِ وَسُوءَ الحِسَابِ",
        "source": "haji"
    },
    {
        "arab": "سُبْحَانَ اللهِ وَالْحَمْدُ لِلَّهِ وَلَا اِلَهَ اِلَّا اللهُ وَاللهُ اَكْبَرْ وَلَا حَوْلَ وَلَا قُوَّةَ اِلِّا بِااللهِ الْعَلِيِّ الْعَظِيْمِ",
        "source": "haji"
    },
    {
        "arab": "سُبْحَانَ اللهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللهَ اللهُ أَكْبَرُ. وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيْمِ. وَالصَّلَاةُ وَالسَّلاَمُ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. اللَّهُمَّ إِيْمَانًا بِكَ وَتَصَدِّيْقًا بِكِتَابِكَ وَوَفَاءاً بِعِبَادِكَ وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. اللَّهُمَّ إِنِّي أَسْئَلُكَ الْعَفْوَى وَالْعَافِيَةَ الدَّائِمَةَ فِي الدِّيْنِ وَالدُّنْيَا وَالْأَخِرَةَ وَالْفَوْزَ بِالْجَنَّةِ وَالنَّجَاةِ مِنَ النَّارِ",
        "source": "haji"
    },
    {
        "arab": "اللَّهُمَّ إِنََ هَذَا الْبَيْتَ بَيْتُكَ وَالْحَرَاَم حَرَامُكَ وَالْأَمْنَ أَمْنُكَ وَالْعَبْدَ عَبْدُكَ وَأَنَا عَبْدُكَ وَابْنُ عَبْدِكَ وَهَذَا مَقَامُ عَيْذُكَ بِكَ مِنْ النَّارِ فَحَرِّمْ لُحُومُنَا وَبَشِّرْنَا عَلَى النَّارِ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْإيْمَانَ وَزَيِّنْهُ فِي قَلُوبِنَا وَكَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ وَاجْعَلْنَا مِنَ الرَّاشِدِينَ اللَّهُمَّ قِنِي عَذَابَكَ الْيَوْمَ تَبْعَثُ عِبَادَكَ اللُّهُمَّ ارْزُقْنَا الْجَنَّةَ بِغَيْرِ حِسَابٍ",
        "source": "haji"
    },
    {
        "arab": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِن الشَّكِّ وَالشِرْكِ والشِّقَاقِ والنِّفَاقِ وسُوءِ الأَخْلاَقِ وَسُوءِ المَنْظَرِ وَالمُنْقَلِبِ فِي المَالِ والأَهْلِ والوَلَدِ اللَّهُمَّ إِنِّي أَسْألُكَ رِضَاكَ والجَنَّةَ وأَعُوذُبِكَ مِن سَخَطِكَ والنَّارِ وَاالهَمِّ إِنِّي أَعُوذُبِكَ مِنْ فِتْنَةِ القُبُرِ وأَعُوذُ بِكَ مِن فِتْنَةِ المَحْيَا والمَمَاتِ",
        "source": "haji"
    },
    {
        "arab": "اللَّهُمَّ اجْعَلْنِي حَجًّا مَبْرُورًا وَسَعْياً مَشْكُورًا وَذُنُباً مَغْفُورًا وَعَمَلًا صَالِحًا مَقْبُولًا وَتِجًارَةً لًنْ تَبُورًا. يَا عَالِمً مَا فِي الصُّدُورِِ أَخْرِجْنِي مِن الظُّلُمَاتِ إِلَى النُورِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَائِمَ مَغْفِرَتِكَ وَالسَّلاَمَةَ مِن كُلِّ إِثْمٍ والغَنِيمَةَ مِن كُلِّ بِرٍّ والفَوْزَ بِالجَنَّةِ مِن النَّارِ رَبِّي قَنِّعْنِي بِمَا رَزَفَنِي وَبَارِكْ لِي فِيمَا أَعْطَيْتَنِي وَاخْلُفْ عَلَيْنَا كُلَّ غَيْبَةٍ مِنْكَ بِخَيْرٍ",
        "source": "haji"
    },
    {
        "arab": "أللَّهُمَّ أَظِلَّنِي تَحْتَ ظِلِّ عَرْشِكَ يَوْمَ لاَ ظِلَّ إِلَّا ظِلَّكَ وَلَا بَقِيَ إِلَّا وَجْهَكَ وَأَسْفِنِي مِنْ حَوْضِ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْكَ وسَلَّم شُرْبَةً هَنِيئَةً مَرِيئَةً لَا أَظَؤُ بَعْدَهَا أَبَدًا. أللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرٍ مَا سَأَلَكَ مِنهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَعُوُذُبِكَ مِنْ شَرِّ مَا عَاذَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّةَ وَنَعِيمَهَا وَمَا يُقَرِّبُنِي إِلَيْهَا مِنْ قَوْلٍ أَوْ فِعْلٍ أَوْ عَمَلٍ وَأَعُوذُبِكَ مِنَ النَّارِ وَمَا يُقَرِّبُنِي إِلَيْهَا مِنْ قَوْلٍ أَْو فِعْلٍ أَوْ عَمَلٍ",
        "source": "haji"
    },
    {
        "arab": "اللَّهُمَّ إِنَّا لَكَ عَلَيَّ حُقُوقًا كَثِيرًا فِيمَا بَيْنِي وَبَيْنَكَ وَحُقُوقًا كثيرا فِيمَا بَيْنِي وَبَيْنَ خَلْقِكَ الَّلهُمَّ مَا كَانَ لَكَ مِنْهَا فَاغْفِرْهُ لِي وَمَا كَانَ لِخَلْقِكَ وَتَحَمَّلَهُ عَنِّي وَأَغْنِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَبِطَاعَتِكَ عنْ مَعْصِيَتِكَ وَبِفَضْلِكَ عَمَّنْ سِوَاكَ يَا وَاسِعَ المَغْفِرَةِ اللََّهُمَّ إِنَّ بَيْتَكَ عَظِيمٌ وَوَجْهَكَ كَرِيْمٌ وَأَنْتَ يَا اللَّهُمََّ حَلِيمٌ كَرِيمٌ عَظِيمٌ تُحِبُّ العَفْوَ فَاعْفُ عَنَّا",
        "source": "haji"
    },
    {
        "arab": "اللَّهُمَّ إِنِّي أَسْأَلُكَ إِيْمَاناً كَامِلًا وَيَقِينًا صَادِقًا وَرِزْقًا وَاسِعًا وَقَلْبًا خَاشِعًا ولِسَانًا ذَاكِرًا وَحَلَالًا طَيِّبًا وَتَوْبَةً نَصُوحًا وَتَوْبَةً قَبْلَ المَوْتِ وَرَاحَةً عِنْدَ المَوْتِ وَمَغْفِرَةً وَرَحْمَةً بَعْدَ الَموْتِ وَالْعَفْوَ عِنْدَ الحِساَبِ واَلفَوْزَ بِالْجَنَّةِ وَالنَّجَاةِ مِنَ النَّارِ بِرَحْمَتِكَ يَا عَزِيْزُ بِاْلصَالِحِينَ",
        "source": "haji"
    },
    {
        "arab": "اللَّهُمَّ يَا رَبَّ البَيْتِ العَتِيْقِ، اَعْتِقْ رِقَابَنَا، وَرِقَابَ آبَائِنَا، وَأُمَّهَاتِنَا وَإخْوَانِنَا وَأَوْلاَدِنَا مِنْ النَارِ، يَا ذَا الجُوْدِ وَالكَرَمِ وَالفَضْلِ وَالمَنِّ وَالعَطَاءِ والإحْسَانِ اللَّهُمَّ أحْسِنْ عاقِبَتَنا في الأمُورِ كُلِّها، وأجِرْنا مِنْ خَزْي الدُّنْيَا وَعَذابِ الآخِرَةِ اللَّهُمَّ إِنِّيْ عَبْدُكَ وَابْنُ عَبْدِكَ، وَاقِفٌ تَحْتَ بَابِكَ مُلْتَزِمٌ بِأَعْتَابِكَ، مُتَذَلِّلٌ بَيْنَ يَدَيْكَ، أَرْجُو رَحْمَتَكَ، وَأَخْشَى عَذَابَكَ، يَاقَدِيْمَ الإِحْسَانِ اللَّهُمَّ إِنِّيْ أَسْألُكَ أَنْ تَرْفَعَ ذِكْرِيْ وَتَضَعَ وِزْرِيْ، وَتُصْلِحَ أَمْرِيْ، وَتُطَهِّرَ قَلْبِيْ، وَتُنَوِّرَ لِيْ فِيْ قَبْرِيْ، وَتَغْفِرَ لِيْ ذَنْبِيْ، وَأَسْألُكَ دَرَجَاتِ العُلَى مِنَ الجَنَّةِ",
        "source": "haji"
    },
    {
        "arab": "الله اكبر، الله اكبر ، الله اكبر، اللَّهُمَّ اسْتَعْمَلْنِيْ بِسُنَةِ نَبِيِّكَ وَتَوَفَّنِيْ عَلَى مِلَّتِهِ وَأعِدْنِيْ مِنْ مُضِلَّاتِ الْفِتَنِ",
        "source": "haji"
    },
    {
        "arab": "اللَّهُمَّ إِنِّي أُحَرِّمُ نَفْسِي مِنْ كُلِّ مَا حَرَّمْتَ عَلَى الْمُحْرِمِ فَارْحَمْنِي يَا أَرْحَمَ الرَّاحِمِيْنَ",
        "source": "haji"
    },
    {
        "arab": "أَكْثَرُ مَا دَعَا بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَشِيَّةَ عَرَفَةَ فِي الْمَوْقِفِ : ” اللَّهُمَّ لَكَ الْحَمْدُ كَالَّذِي نَقُولُ وَخَيْرًا مِمَّا نَقُولُ ، اللَّهُمَّ لَكَ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي وَإِلَيْكَ مَآبِي وَلَكَ رَبِّ تُرَاثِي ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَوَسْوَسَةِ الصَّدْرِ وَشَتَاتِ الْأَمْرِ ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا تَجِيءُ بِهِ الرِّيحُ",
        "source": "haji"
    },
    {
        "arab": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لاَ إِلَـٰهَ إِلاَّ أَنْتَ، أَسْتَغْفِرُكَ، وَأَتُوْبُ إِلَيْكَ",
        "source": "lainnya"
    },
    {
        "arab": "اَللَّهُمَّ إِنِّيْ أَسْتَغْفـِرُكَ مِنْ كُلِّ ذَنْبٍ تُبْتُ إِلَيْكَ مِنْهُ ثُمَّ عُدْتُ فِيْهِ وَأَسْتَغْفِرُكَ لِمَا وَعَدْتُكَ بِهِ مِنْ نَفْسِيْ ثُمَّ أَخْلَفْتُكَ فِيْهِ وَأَسْتَغْفِرُكَ لِمَا أَرَدْتُ بِهِ وَجْهَكَ الْكَرِيْمَ فَخَالَطَهُ غَيْرُكَ وَأَسْتَغْفِرُكَ مِنْ كُلِّ نِعْمَةٍ اَنْعَمْتَ عَلَيْهَا عَلَيَّ فَاسْتَعَنْتُ بِهَا عَلَى مَعْصِيَتِكَ وَأَسْتَغْفِرُكَ يَاعَالِمَ الْغَيْبِ وَالشَّهَادَةِ مِنْ كُلِّ ذَنْبٍ اَتَيْتُهُ فِيْ ضِيَاءِ النَّهَارِ وَسَوَادِ اللَّيْلِ، فِيْ مَلَإٍ وَخَلاَءٍ، وَسِـرٍّ وَعَلاَنِـيَّـةٍ يَاحَلِيْمُ",
        "source": "lainnya"
    },
    {
        "arab": "صَلَّى اللهُ عَلَى نَبِيِّنَا مُحَمَّدٍ كُلَّمَا ذَكَرَهُ الذَّاكِرُوْنَ وَغَفَلَ عَنْ ذِكْرِهِ الْغَافِلُوْنَ",
        "source": "lainnya"
    },
    {
        "arab": "اَللّٰهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَاَنْزِلهُ الْمُنزَلَ الْمُقَرَّبَ مِنكَ يَومَ القِيَامَةِ ",
        "source": "lainnya"
    },
    {
        "arab": "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
        "source": "lainnya"
    },
    {
        "arab": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
        "source": "lainnya"
    },
    {
        "arab": "رَّبِّ أَدْخِلْنِى مُدْخَلَ صِدْقٍ وَأَخْرِجْنِى مُخْرَجَ صِدْقٍ وَٱجْعَل لِّى مِن لَّدُنكَ سُلْطَٰنًا نَّصِيرًا",
        "source": "lainnya"
    },
    {
        "arab": "اَللّٰهُمَّ مَٰلِكَ ٱلْمُلْكِ تُؤْتِى ٱلْمُلْكَ مَن تَشَآءُ وَتَنزِعُ ٱلْمُلْكَ مِمَّن تَشَآءُ وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُ ۖ بِيَدِكَ ٱلْخَيْرُ ۖ إِنَّكَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
        "source": "lainnya"
    }
]

export default function Doaa({ route, navigation }) {
    const theme = useTheme();
    return (
        <View style={{ direction: 'ltr', flex: 1, backgroundColor: theme['background-basic-color-3'] }}>
            <FlashList estimatedItemSize={200} data={doaa} renderItem={itemData => {
                return (
                    <View>
                        <Pressable style={styles.inAz} android_ripple={{ color: '#10151f' }}>
                            <Card style={styles.card}
                                onPress={async () => await Share.share({
                                    message: itemData.item.arab,
                                    title: 'دعاء'
                                })}

                                footer={() => {
                                    return <View style={{ justifyContent: 'center', flexDirection: 'row', }}>
                                        <Pressable onPress={async () => await Share.share({
                                            message: itemData.item.arab,
                                            title: 'دعاء'
                                        })}>
                                            <View style={{ justifyContent: 'center', flexDirection: 'row', alignItems: 'center' }}>
                                                <Text style={{ fontFamily: 'font1', padding: 10, fontSize: 23, color: '#00bfff' }} key={itemData.item.arab + itemData.item.arab + ''}>مشاركة
                                                </Text>
                                                <Text style={{}}><Ionicons name='share-social' size={30} color={'#00bfff'}></Ionicons></Text>
                                            </View>
                                        </Pressable>
                                    </View>
                                }}>
                                <Text style={[styles.inAztext, { fontFamily: 'font2', color: '#f89b05', textShadowColor: 'black', textShadowOffset: { height: 2, width: 2 }, textShadowRadius: 5 }]} key={itemData.item.id}>{itemData.item.arab}</Text>
                            </Card>
                        </Pressable>
                    </View>
                );
            }}
                keyExtractor={(item, i) => { return i }}
            />
        </View>
    );
}
const styles = StyleSheet.create({
    zekr: {
        width: '100%',
        textAlign: 'center',
        borderRadius: 10,
        backgroundColor: 'black',
        marginVertical: 5,

    },
    card: {

        borderColor: 'white',
        borderWidth: 2,
    },
    inAz: {
        fontSize: 23,
        fontFamily: 'font1',
        padding: 15,
    },
    inAztext: {
        fontSize: 23,
        lineHeight: 40
    },
});
